docs/evidence/mandate-17/reliability-20260724-141759/baseline-k6.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts\maintenance-load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 40 max VUs, 5m30s max duration (incl. graceful stop):
              * money_flow: 2.00 iterations/s for 5m0s (maxVUs: 40, gracefulStop: 30s)


running (0m01.0s), 03/40 VUs, 0 complete and 0 interrupted iterations
money_flow   [   0% ] 03/40 VUs  0m01.0s/5m0s  2.00 iters/s

running (0m02.0s), 04/40 VUs, 0 complete and 0 interrupted iterations
money_flow   [   1% ] 04/40 VUs  0m02.0s/5m0s  2.00 iters/s

running (0m03.0s), 05/40 VUs, 1 complete and 0 interrupted iterations
money_flow   [   1% ] 05/40 VUs  0m03.0s/5m0s  2.00 iters/s

running (0m04.0s), 06/40 VUs, 2 complete and 0 interrupted iterations
money_flow   [   1% ] 06/40 VUs  0m04.0s/5m0s  2.00 iters/s

running (0m05.0s), 08/40 VUs, 2 complete and 0 interrupted iterations
money_flow   [   2% ] 08/40 VUs  0m05.0s/5m0s  2.00 iters/s

running (0m06.0s), 10/40 VUs, 2 complete and 0 interrupted iterations
money_flow   [   2% ] 10/40 VUs  0m06.0s/5m0s  2.00 iters/s

running (0m07.0s), 12/40 VUs, 2 complete and 0 interrupted iterations
money_flow   [   2% ] 12/40 VUs  0m07.0s/5m0s  2.00 iters/s

running (0m08.0s), 13/40 VUs, 3 complete and 0 interrupted iterations
money_flow   [   3% ] 13/40 VUs  0m08.0s/5m0s  2.00 iters/s

running (0m09.0s), 14/40 VUs, 4 complete and 0 interrupted iterations
money_flow   [   3% ] 14/40 VUs  0m09.0s/5m0s  2.00 iters/s

running (0m10.0s), 16/40 VUs, 4 complete and 0 interrupted iterations
money_flow   [   3% ] 16/40 VUs  0m10.0s/5m0s  2.00 iters/s

running (0m11.0s), 18/40 VUs, 4 complete and 0 interrupted iterations
money_flow   [   4% ] 18/40 VUs  0m11.0s/5m0s  2.00 iters/s

running (0m12.0s), 19/40 VUs, 5 complete and 0 interrupted iterations
money_flow   [   4% ] 19/40 VUs  0m12.0s/5m0s  2.00 iters/s

running (0m13.0s), 21/40 VUs, 5 complete and 0 interrupted iterations
money_flow   [   4% ] 21/40 VUs  0m13.0s/5m0s  2.00 iters/s

running (0m14.0s), 22/40 VUs, 6 complete and 0 interrupted iterations
money_flow   [   5% ] 22/40 VUs  0m14.0s/5m0s  2.00 iters/s

running (0m15.0s), 24/40 VUs, 6 complete and 0 interrupted iterations
money_flow   [   5% ] 24/40 VUs  0m15.0s/5m0s  2.00 iters/s

running (0m16.0s), 25/40 VUs, 7 complete and 0 interrupted iterations
money_flow   [   5% ] 25/40 VUs  0m16.0s/5m0s  2.00 iters/s

running (0m17.0s), 27/40 VUs, 7 complete and 0 interrupted iterations
money_flow   [   6% ] 27/40 VUs  0m17.0s/5m0s  2.00 iters/s

running (0m18.0s), 29/40 VUs, 7 complete and 0 interrupted iterations
money_flow   [   6% ] 29/40 VUs  0m18.0s/5m0s  2.00 iters/s

running (0m19.0s), 28/40 VUs, 10 complete and 0 interrupted iterations
money_flow   [   6% ] 28/40 VUs  0m19.0s/5m0s  2.00 iters/s

running (0m20.0s), 27/40 VUs, 13 complete and 0 interrupted iterations
money_flow   [   7% ] 27/40 VUs  0m20.0s/5m0s  2.00 iters/s

running (0m21.0s), 24/40 VUs, 18 complete and 0 interrupted iterations
money_flow   [   7% ] 24/40 VUs  0m21.0s/5m0s  2.00 iters/s

running (0m22.0s), 26/40 VUs, 18 complete and 0 interrupted iterations
money_flow   [   7% ] 26/40 VUs  0m22.0s/5m0s  2.00 iters/s

running (0m23.0s), 26/40 VUs, 20 complete and 0 interrupted iterations
money_flow   [   8% ] 26/40 VUs  0m23.0s/5m0s  2.00 iters/s

running (0m24.0s), 20/40 VUs, 28 complete and 0 interrupted iterations
money_flow   [   8% ] 20/40 VUs  0m24.0s/5m0s  2.00 iters/s

running (0m25.0s), 15/40 VUs, 35 complete and 0 interrupted iterations
money_flow   [   8% ] 15/40 VUs  0m25.0s/5m0s  2.00 iters/s

running (0m26.0s), 16/40 VUs, 36 complete and 0 interrupted iterations
money_flow   [   9% ] 16/40 VUs  0m26.0s/5m0s  2.00 iters/s

running (0m27.0s), 16/40 VUs, 38 complete and 0 interrupted iterations
money_flow   [   9% ] 16/40 VUs  0m27.0s/5m0s  2.00 iters/s

running (0m28.0s), 15/40 VUs, 41 complete and 0 interrupted iterations
money_flow   [   9% ] 15/40 VUs  0m28.0s/5m0s  2.00 iters/s

running (0m29.0s), 16/40 VUs, 42 complete and 0 interrupted iterations
money_flow   [  10% ] 16/40 VUs  0m29.0s/5m0s  2.00 iters/s

running (0m30.0s), 18/40 VUs, 42 complete and 0 interrupted iterations
money_flow   [  10% ] 18/40 VUs  0m30.0s/5m0s  2.00 iters/s

running (0m31.0s), 20/40 VUs, 42 complete and 0 interrupted iterations
money_flow   [  10% ] 20/40 VUs  0m31.0s/5m0s  2.00 iters/s

running (0m32.0s), 22/40 VUs, 42 complete and 0 interrupted iterations
money_flow   [  11% ] 22/40 VUs  0m32.0s/5m0s  2.00 iters/s

running (0m33.0s), 22/40 VUs, 44 complete and 0 interrupted iterations
money_flow   [  11% ] 22/40 VUs  0m33.0s/5m0s  2.00 iters/s

running (0m34.0s), 23/40 VUs, 45 complete and 0 interrupted iterations
money_flow   [  11% ] 23/40 VUs  0m34.0s/5m0s  2.00 iters/s

running (0m35.0s), 23/40 VUs, 47 complete and 0 interrupted iterations
money_flow   [  12% ] 23/40 VUs  0m35.0s/5m0s  2.00 iters/s

running (0m36.0s), 18/40 VUs, 54 complete and 0 interrupted iterations
money_flow   [  12% ] 18/40 VUs  0m36.0s/5m0s  2.00 iters/s

running (0m37.0s), 18/40 VUs, 56 complete and 0 interrupted iterations
money_flow   [  12% ] 18/40 VUs  0m37.0s/5m0s  2.00 iters/s

running (0m38.0s), 19/40 VUs, 57 complete and 0 interrupted iterations
money_flow   [  13% ] 19/40 VUs  0m38.0s/5m0s  2.00 iters/s

running (0m39.0s), 17/40 VUs, 61 complete and 0 interrupted iterations
money_flow   [  13% ] 17/40 VUs  0m39.0s/5m0s  2.00 iters/s

running (0m40.0s), 16/40 VUs, 64 complete and 0 interrupted iterations
money_flow   [  13% ] 16/40 VUs  0m40.0s/5m0s  2.00 iters/s

running (0m41.0s), 17/40 VUs, 65 complete and 0 interrupted iterations
money_flow   [  14% ] 17/40 VUs  0m41.0s/5m0s  2.00 iters/s

running (0m42.0s), 19/40 VUs, 65 complete and 0 interrupted iterations
money_flow   [  14% ] 19/40 VUs  0m42.0s/5m0s  2.00 iters/s

running (0m43.0s), 20/40 VUs, 66 complete and 0 interrupted iterations
money_flow   [  14% ] 20/40 VUs  0m43.0s/5m0s  2.00 iters/s

running (0m44.0s), 22/40 VUs, 66 complete and 0 interrupted iterations
money_flow   [  15% ] 22/40 VUs  0m44.0s/5m0s  2.00 iters/s

running (0m45.0s), 23/40 VUs, 67 complete and 0 interrupted iterations
money_flow   [  15% ] 23/40 VUs  0m45.0s/5m0s  2.00 iters/s

running (0m46.0s), 21/40 VUs, 71 complete and 0 interrupted iterations
money_flow   [  15% ] 21/40 VUs  0m46.0s/5m0s  2.00 iters/s

running (0m47.0s), 21/40 VUs, 73 complete and 0 interrupted iterations
money_flow   [  16% ] 21/40 VUs  0m47.0s/5m0s  2.00 iters/s

running (0m48.0s), 21/40 VUs, 75 complete and 0 interrupted iterations
money_flow   [  16% ] 21/40 VUs  0m48.0s/5m0s  2.00 iters/s

running (0m49.0s), 19/40 VUs, 79 complete and 0 interrupted iterations
money_flow   [  16% ] 19/40 VUs  0m49.0s/5m0s  2.00 iters/s

running (0m50.0s), 16/40 VUs, 84 complete and 0 interrupted iterations
money_flow   [  17% ] 16/40 VUs  0m50.0s/5m0s  2.00 iters/s

running (0m51.0s), 14/40 VUs, 88 complete and 0 interrupted iterations
money_flow   [  17% ] 14/40 VUs  0m51.0s/5m0s  2.00 iters/s

running (0m52.0s), 14/40 VUs, 90 complete and 0 interrupted iterations
money_flow   [  17% ] 14/40 VUs  0m52.0s/5m0s  2.00 iters/s

running (0m53.0s), 16/40 VUs, 90 complete and 0 interrupted iterations
money_flow   [  18% ] 16/40 VUs  0m53.0s/5m0s  2.00 iters/s

running (0m54.0s), 15/40 VUs, 93 complete and 0 interrupted iterations
money_flow   [  18% ] 15/40 VUs  0m54.0s/5m0s  2.00 iters/s

running (0m55.0s), 17/40 VUs, 93 complete and 0 interrupted iterations
money_flow   [  18% ] 17/40 VUs  0m55.0s/5m0s  2.00 iters/s

running (0m56.0s), 17/40 VUs, 95 complete and 0 interrupted iterations
money_flow   [  19% ] 17/40 VUs  0m56.0s/5m0s  2.00 iters/s

running (0m57.0s), 15/40 VUs, 99 complete and 0 interrupted iterations
money_flow   [  19% ] 15/40 VUs  0m57.0s/5m0s  2.00 iters/s

running (0m58.0s), 13/40 VUs, 103 complete and 0 interrupted iterations
money_flow   [  19% ] 13/40 VUs  0m58.0s/5m0s  2.00 iters/s

running (0m59.0s), 13/40 VUs, 105 complete and 0 interrupted iterations
money_flow   [  20% ] 13/40 VUs  0m59.0s/5m0s  2.00 iters/s

running (1m00.0s), 15/40 VUs, 105 complete and 0 interrupted iterations
money_flow   [  20% ] 15/40 VUs  1m00.0s/5m0s  2.00 iters/s

running (1m01.0s), 15/40 VUs, 107 complete and 0 interrupted iterations
money_flow   [  20% ] 15/40 VUs  1m01.0s/5m0s  2.00 iters/s

running (1m02.0s), 15/40 VUs, 109 complete and 0 interrupted iterations
money_flow   [  21% ] 15/40 VUs  1m02.0s/5m0s  2.00 iters/s

running (1m03.0s), 17/40 VUs, 109 complete and 0 interrupted iterations
money_flow   [  21% ] 17/40 VUs  1m03.0s/5m0s  2.00 iters/s

running (1m04.0s), 09/40 VUs, 119 complete and 0 interrupted iterations
money_flow   [  21% ] 09/40 VUs  1m04.0s/5m0s  2.00 iters/s

running (1m05.0s), 10/40 VUs, 120 complete and 0 interrupted iterations
money_flow   [  22% ] 10/40 VUs  1m05.0s/5m0s  2.00 iters/s

running (1m06.0s), 08/40 VUs, 124 complete and 0 interrupted iterations
money_flow   [  22% ] 08/40 VUs  1m06.0s/5m0s  2.00 iters/s

running (1m07.0s), 10/40 VUs, 124 complete and 0 interrupted iterations
money_flow   [  22% ] 10/40 VUs  1m07.0s/5m0s  2.00 iters/s

running (1m08.0s), 12/40 VUs, 124 complete and 0 interrupted iterations
money_flow   [  23% ] 12/40 VUs  1m08.0s/5m0s  2.00 iters/s

running (1m09.0s), 14/40 VUs, 124 complete and 0 interrupted iterations
money_flow   [  23% ] 14/40 VUs  1m09.0s/5m0s  2.00 iters/s

running (1m10.0s), 14/40 VUs, 126 complete and 0 interrupted iterations
money_flow   [  23% ] 14/40 VUs  1m10.0s/5m0s  2.00 iters/s

running (1m11.0s), 15/40 VUs, 127 complete and 0 interrupted iterations
money_flow   [  24% ] 15/40 VUs  1m11.0s/5m0s  2.00 iters/s

running (1m12.0s), 14/40 VUs, 130 complete and 0 interrupted iterations
money_flow   [  24% ] 14/40 VUs  1m12.0s/5m0s  2.00 iters/s

running (1m13.0s), 12/40 VUs, 134 complete and 0 interrupted iterations
money_flow   [  24% ] 12/40 VUs  1m13.0s/5m0s  2.00 iters/s

running (1m14.0s), 11/40 VUs, 137 complete and 0 interrupted iterations
money_flow   [  25% ] 11/40 VUs  1m14.0s/5m0s  2.00 iters/s

running (1m15.0s), 13/40 VUs, 137 complete and 0 interrupted iterations
money_flow   [  25% ] 13/40 VUs  1m15.0s/5m0s  2.00 iters/s

running (1m16.0s), 14/40 VUs, 138 complete and 0 interrupted iterations
money_flow   [  25% ] 14/40 VUs  1m16.0s/5m0s  2.00 iters/s

running (1m17.0s), 13/40 VUs, 141 complete and 0 interrupted iterations
money_flow   [  26% ] 13/40 VUs  1m17.0s/5m0s  2.00 iters/s

running (1m18.0s), 14/40 VUs, 142 complete and 0 interrupted iterations
money_flow   [  26% ] 14/40 VUs  1m18.0s/5m0s  2.00 iters/s

running (1m19.0s), 13/40 VUs, 145 complete and 0 interrupted iterations
money_flow   [  26% ] 13/40 VUs  1m19.0s/5m0s  2.00 iters/s

running (1m20.0s), 15/40 VUs, 145 complete and 0 interrupted iterations
money_flow   [  27% ] 15/40 VUs  1m20.0s/5m0s  2.00 iters/s

running (1m21.0s), 16/40 VUs, 146 complete and 0 interrupted iterations
money_flow   [  27% ] 16/40 VUs  1m21.0s/5m0s  2.00 iters/s

running (1m22.0s), 17/40 VUs, 147 complete and 0 interrupted iterations
money_flow   [  27% ] 17/40 VUs  1m22.0s/5m0s  2.00 iters/s

running (1m23.0s), 18/40 VUs, 148 complete and 0 interrupted iterations
money_flow   [  28% ] 18/40 VUs  1m23.0s/5m0s  2.00 iters/s

running (1m24.0s), 20/40 VUs, 148 complete and 0 interrupted iterations
money_flow   [  28% ] 20/40 VUs  1m24.0s/5m0s  2.00 iters/s

running (1m25.0s), 15/40 VUs, 155 complete and 0 interrupted iterations
money_flow   [  28% ] 15/40 VUs  1m25.0s/5m0s  2.00 iters/s

running (1m26.0s), 11/40 VUs, 161 complete and 0 interrupted iterations
money_flow   [  29% ] 11/40 VUs  1m26.0s/5m0s  2.00 iters/s

running (1m27.0s), 12/40 VUs, 162 complete and 0 interrupted iterations
money_flow   [  29% ] 12/40 VUs  1m27.0s/5m0s  2.00 iters/s

running (1m28.0s), 11/40 VUs, 165 complete and 0 interrupted iterations
money_flow   [  29% ] 11/40 VUs  1m28.0s/5m0s  2.00 iters/s

running (1m29.0s), 12/40 VUs, 166 complete and 0 interrupted iterations
money_flow   [  30% ] 12/40 VUs  1m29.0s/5m0s  2.00 iters/s

running (1m30.0s), 12/40 VUs, 168 complete and 0 interrupted iterations
money_flow   [  30% ] 12/40 VUs  1m30.0s/5m0s  2.00 iters/s

running (1m31.0s), 10/40 VUs, 172 complete and 0 interrupted iterations
money_flow   [  30% ] 10/40 VUs  1m31.0s/5m0s  2.00 iters/s

running (1m32.0s), 10/40 VUs, 174 complete and 0 interrupted iterations
money_flow   [  31% ] 10/40 VUs  1m32.0s/5m0s  2.00 iters/s

running (1m33.0s), 11/40 VUs, 175 complete and 0 interrupted iterations
money_flow   [  31% ] 11/40 VUs  1m33.0s/5m0s  2.00 iters/s

running (1m34.0s), 12/40 VUs, 176 complete and 0 interrupted iterations
money_flow   [  31% ] 12/40 VUs  1m34.0s/5m0s  2.00 iters/s

running (1m35.0s), 12/40 VUs, 178 complete and 0 interrupted iterations
money_flow   [  32% ] 12/40 VUs  1m35.0s/5m0s  2.00 iters/s

running (1m36.0s), 14/40 VUs, 178 complete and 0 interrupted iterations
money_flow   [  32% ] 14/40 VUs  1m36.0s/5m0s  2.00 iters/s

running (1m37.0s), 13/40 VUs, 181 complete and 0 interrupted iterations
money_flow   [  32% ] 13/40 VUs  1m37.0s/5m0s  2.00 iters/s

running (1m38.0s), 12/40 VUs, 184 complete and 0 interrupted iterations
money_flow   [  33% ] 12/40 VUs  1m38.0s/5m0s  2.00 iters/s

running (1m39.0s), 12/40 VUs, 186 complete and 0 interrupted iterations
money_flow   [  33% ] 12/40 VUs  1m39.0s/5m0s  2.00 iters/s

running (1m40.0s), 12/40 VUs, 188 complete and 0 interrupted iterations
money_flow   [  33% ] 12/40 VUs  1m40.0s/5m0s  2.00 iters/s

running (1m41.0s), 14/40 VUs, 188 complete and 0 interrupted iterations
money_flow   [  34% ] 14/40 VUs  1m41.0s/5m0s  2.00 iters/s

running (1m42.0s), 16/40 VUs, 188 complete and 0 interrupted iterations
money_flow   [  34% ] 16/40 VUs  1m42.0s/5m0s  2.00 iters/s

running (1m43.0s), 18/40 VUs, 188 complete and 0 interrupted iterations
money_flow   [  34% ] 18/40 VUs  1m43.0s/5m0s  2.00 iters/s

running (1m44.0s), 16/40 VUs, 192 complete and 0 interrupted iterations
money_flow   [  35% ] 16/40 VUs  1m44.0s/5m0s  2.00 iters/s

running (1m45.0s), 16/40 VUs, 194 complete and 0 interrupted iterations
money_flow   [  35% ] 16/40 VUs  1m45.0s/5m0s  2.00 iters/s

running (1m46.0s), 17/40 VUs, 195 complete and 0 interrupted iterations
money_flow   [  35% ] 17/40 VUs  1m46.0s/5m0s  2.00 iters/s

running (1m47.0s), 12/40 VUs, 202 complete and 0 interrupted iterations
money_flow   [  36% ] 12/40 VUs  1m47.0s/5m0s  2.00 iters/s

running (1m48.0s), 13/40 VUs, 203 complete and 0 interrupted iterations
money_flow   [  36% ] 13/40 VUs  1m48.0s/5m0s  2.00 iters/s

running (1m49.0s), 14/40 VUs, 204 complete and 0 interrupted iterations
money_flow   [  36% ] 14/40 VUs  1m49.0s/5m0s  2.00 iters/s

running (1m50.0s), 13/40 VUs, 207 complete and 0 interrupted iterations
money_flow   [  37% ] 13/40 VUs  1m50.0s/5m0s  2.00 iters/s

running (1m51.0s), 15/40 VUs, 207 complete and 0 interrupted iterations
money_flow   [  37% ] 15/40 VUs  1m51.0s/5m0s  2.00 iters/s

running (1m52.0s), 12/40 VUs, 212 complete and 0 interrupted iterations
money_flow   [  37% ] 12/40 VUs  1m52.0s/5m0s  2.00 iters/s

running (1m53.0s), 14/40 VUs, 212 complete and 0 interrupted iterations
money_flow   [  38% ] 14/40 VUs  1m53.0s/5m0s  2.00 iters/s

running (1m54.0s), 15/40 VUs, 213 complete and 0 interrupted iterations
money_flow   [  38% ] 15/40 VUs  1m54.0s/5m0s  2.00 iters/s

running (1m55.0s), 15/40 VUs, 215 complete and 0 interrupted iterations
money_flow   [  38% ] 15/40 VUs  1m55.0s/5m0s  2.00 iters/s

running (1m56.0s), 17/40 VUs, 215 complete and 0 interrupted iterations
money_flow   [  39% ] 17/40 VUs  1m56.0s/5m0s  2.00 iters/s

running (1m57.0s), 16/40 VUs, 218 complete and 0 interrupted iterations
money_flow   [  39% ] 16/40 VUs  1m57.0s/5m0s  2.00 iters/s

running (1m58.0s), 13/40 VUs, 223 complete and 0 interrupted iterations
money_flow   [  39% ] 13/40 VUs  1m58.0s/5m0s  2.00 iters/s

running (1m59.0s), 11/40 VUs, 227 complete and 0 interrupted iterations
money_flow   [  40% ] 11/40 VUs  1m59.0s/5m0s  2.00 iters/s

running (2m00.0s), 12/40 VUs, 228 complete and 0 interrupted iterations
money_flow   [  40% ] 12/40 VUs  2m00.0s/5m0s  2.00 iters/s

running (2m01.0s), 13/40 VUs, 229 complete and 0 interrupted iterations
money_flow   [  40% ] 13/40 VUs  2m01.0s/5m0s  2.00 iters/s

running (2m02.0s), 14/40 VUs, 230 complete and 0 interrupted iterations
money_flow   [  41% ] 14/40 VUs  2m02.0s/5m0s  2.00 iters/s

running (2m03.0s), 15/40 VUs, 231 complete and 0 interrupted iterations
money_flow   [  41% ] 15/40 VUs  2m03.0s/5m0s  2.00 iters/s

running (2m04.0s), 12/40 VUs, 236 complete and 0 interrupted iterations
money_flow   [  41% ] 12/40 VUs  2m04.0s/5m0s  2.00 iters/s

running (2m05.0s), 10/40 VUs, 240 complete and 0 interrupted iterations
money_flow   [  42% ] 10/40 VUs  2m05.0s/5m0s  2.00 iters/s

running (2m06.0s), 11/40 VUs, 241 complete and 0 interrupted iterations
money_flow   [  42% ] 11/40 VUs  2m06.0s/5m0s  2.00 iters/s

running (2m07.0s), 08/40 VUs, 246 complete and 0 interrupted iterations
money_flow   [  42% ] 08/40 VUs  2m07.0s/5m0s  2.00 iters/s

running (2m08.0s), 09/40 VUs, 247 complete and 0 interrupted iterations
money_flow   [  43% ] 09/40 VUs  2m08.0s/5m0s  2.00 iters/s

running (2m09.0s), 11/40 VUs, 247 complete and 0 interrupted iterations
money_flow   [  43% ] 11/40 VUs  2m09.0s/5m0s  2.00 iters/s

running (2m10.0s), 11/40 VUs, 249 complete and 0 interrupted iterations
money_flow   [  43% ] 11/40 VUs  2m10.0s/5m0s  2.00 iters/s

running (2m11.0s), 11/40 VUs, 251 complete and 0 interrupted iterations
money_flow   [  44% ] 11/40 VUs  2m11.0s/5m0s  2.00 iters/s

running (2m12.0s), 12/40 VUs, 252 complete and 0 interrupted iterations
money_flow   [  44% ] 12/40 VUs  2m12.0s/5m0s  2.00 iters/s

running (2m13.0s), 14/40 VUs, 252 complete and 0 interrupted iterations
money_flow   [  44% ] 14/40 VUs  2m13.0s/5m0s  2.00 iters/s

running (2m14.0s), 13/40 VUs, 255 complete and 0 interrupted iterations
money_flow   [  45% ] 13/40 VUs  2m14.0s/5m0s  2.00 iters/s

running (2m15.0s), 13/40 VUs, 257 complete and 0 interrupted iterations
money_flow   [  45% ] 13/40 VUs  2m15.0s/5m0s  2.00 iters/s

running (2m16.0s), 10/40 VUs, 262 complete and 0 interrupted iterations
money_flow   [  45% ] 10/40 VUs  2m16.0s/5m0s  2.00 iters/s

running (2m17.0s), 11/40 VUs, 263 complete and 0 interrupted iterations
money_flow   [  46% ] 11/40 VUs  2m17.0s/5m0s  2.00 iters/s

running (2m18.0s), 11/40 VUs, 265 complete and 0 interrupted iterations
money_flow   [  46% ] 11/40 VUs  2m18.0s/5m0s  2.00 iters/s

running (2m19.0s), 13/40 VUs, 265 complete and 0 interrupted iterations
money_flow   [  46% ] 13/40 VUs  2m19.0s/5m0s  2.00 iters/s

running (2m20.0s), 12/40 VUs, 268 complete and 0 interrupted iterations
money_flow   [  47% ] 12/40 VUs  2m20.0s/5m0s  2.00 iters/s

running (2m21.0s), 12/40 VUs, 270 complete and 0 interrupted iterations
money_flow   [  47% ] 12/40 VUs  2m21.0s/5m0s  2.00 iters/s

running (2m22.0s), 14/40 VUs, 270 complete and 0 interrupted iterations
money_flow   [  47% ] 14/40 VUs  2m22.0s/5m0s  2.00 iters/s

running (2m23.0s), 13/40 VUs, 273 complete and 0 interrupted iterations
money_flow   [  48% ] 13/40 VUs  2m23.0s/5m0s  2.00 iters/s

running (2m24.0s), 14/40 VUs, 274 complete and 0 interrupted iterations
money_flow   [  48% ] 14/40 VUs  2m24.0s/5m0s  2.00 iters/s

running (2m25.0s), 15/40 VUs, 275 complete and 0 interrupted iterations
money_flow   [  48% ] 15/40 VUs  2m25.0s/5m0s  2.00 iters/s

running (2m26.0s), 13/40 VUs, 279 complete and 0 interrupted iterations
money_flow   [  49% ] 13/40 VUs  2m26.0s/5m0s  2.00 iters/s

running (2m27.0s), 11/40 VUs, 283 complete and 0 interrupted iterations
money_flow   [  49% ] 11/40 VUs  2m27.0s/5m0s  2.00 iters/s

running (2m28.0s), 10/40 VUs, 286 complete and 0 interrupted iterations
money_flow   [  49% ] 10/40 VUs  2m28.0s/5m0s  2.00 iters/s

running (2m29.0s), 11/40 VUs, 287 complete and 0 interrupted iterations
money_flow   [  50% ] 11/40 VUs  2m29.0s/5m0s  2.00 iters/s

running (2m30.0s), 12/40 VUs, 288 complete and 0 interrupted iterations
money_flow   [  50% ] 12/40 VUs  2m30.0s/5m0s  2.00 iters/s

running (2m31.0s), 13/40 VUs, 289 complete and 0 interrupted iterations
money_flow   [  50% ] 13/40 VUs  2m31.0s/5m0s  2.00 iters/s

running (2m32.0s), 12/40 VUs, 292 complete and 0 interrupted iterations
money_flow   [  51% ] 12/40 VUs  2m32.0s/5m0s  2.00 iters/s

running (2m33.0s), 13/40 VUs, 293 complete and 0 interrupted iterations
money_flow   [  51% ] 13/40 VUs  2m33.0s/5m0s  2.00 iters/s

running (2m34.0s), 15/40 VUs, 293 complete and 0 interrupted iterations
money_flow   [  51% ] 15/40 VUs  2m34.0s/5m0s  2.00 iters/s

running (2m35.0s), 13/40 VUs, 297 complete and 0 interrupted iterations
money_flow   [  52% ] 13/40 VUs  2m35.0s/5m0s  2.00 iters/s

running (2m36.0s), 14/40 VUs, 298 complete and 0 interrupted iterations
money_flow   [  52% ] 14/40 VUs  2m36.0s/5m0s  2.00 iters/s

running (2m37.0s), 15/40 VUs, 299 complete and 0 interrupted iterations
money_flow   [  52% ] 15/40 VUs  2m37.0s/5m0s  2.00 iters/s

running (2m38.0s), 16/40 VUs, 300 complete and 0 interrupted iterations
money_flow   [  53% ] 16/40 VUs  2m38.0s/5m0s  2.00 iters/s

running (2m39.0s), 18/40 VUs, 300 complete and 0 interrupted iterations
money_flow   [  53% ] 18/40 VUs  2m39.0s/5m0s  2.00 iters/s

running (2m40.0s), 13/40 VUs, 307 complete and 0 interrupted iterations
money_flow   [  53% ] 13/40 VUs  2m40.0s/5m0s  2.00 iters/s

running (2m41.0s), 13/40 VUs, 309 complete and 0 interrupted iterations
money_flow   [  54% ] 13/40 VUs  2m41.0s/5m0s  2.00 iters/s

running (2m42.0s), 15/40 VUs, 309 complete and 0 interrupted iterations
money_flow   [  54% ] 15/40 VUs  2m42.0s/5m0s  2.00 iters/s

running (2m43.0s), 14/40 VUs, 312 complete and 0 interrupted iterations
money_flow   [  54% ] 14/40 VUs  2m43.0s/5m0s  2.00 iters/s

running (2m44.0s), 12/40 VUs, 316 complete and 0 interrupted iterations
money_flow   [  55% ] 12/40 VUs  2m44.0s/5m0s  2.00 iters/s

running (2m45.0s), 09/40 VUs, 321 complete and 0 interrupted iterations
money_flow   [  55% ] 09/40 VUs  2m45.0s/5m0s  2.00 iters/s

running (2m46.0s), 10/40 VUs, 322 complete and 0 interrupted iterations
money_flow   [  55% ] 10/40 VUs  2m46.0s/5m0s  2.00 iters/s

running (2m47.0s), 11/40 VUs, 323 complete and 0 interrupted iterations
money_flow   [  56% ] 11/40 VUs  2m47.0s/5m0s  2.00 iters/s

running (2m48.0s), 10/40 VUs, 326 complete and 0 interrupted iterations
money_flow   [  56% ] 10/40 VUs  2m48.0s/5m0s  2.00 iters/s

running (2m49.0s), 12/40 VUs, 326 complete and 0 interrupted iterations
money_flow   [  56% ] 12/40 VUs  2m49.0s/5m0s  2.00 iters/s

running (2m50.0s), 12/40 VUs, 328 complete and 0 interrupted iterations
money_flow   [  57% ] 12/40 VUs  2m50.0s/5m0s  2.00 iters/s

running (2m51.0s), 11/40 VUs, 331 complete and 0 interrupted iterations
money_flow   [  57% ] 11/40 VUs  2m51.0s/5m0s  2.00 iters/s

running (2m52.0s), 10/40 VUs, 334 complete and 0 interrupted iterations
money_flow   [  57% ] 10/40 VUs  2m52.0s/5m0s  2.00 iters/s

running (2m53.0s), 12/40 VUs, 334 complete and 0 interrupted iterations
money_flow   [  58% ] 12/40 VUs  2m53.0s/5m0s  2.00 iters/s

running (2m54.0s), 13/40 VUs, 335 complete and 0 interrupted iterations
money_flow   [  58% ] 13/40 VUs  2m54.0s/5m0s  2.00 iters/s

running (2m55.0s), 15/40 VUs, 335 complete and 0 interrupted iterations
money_flow   [  58% ] 15/40 VUs  2m55.0s/5m0s  2.00 iters/s

running (2m56.0s), 17/40 VUs, 335 complete and 0 interrupted iterations
money_flow   [  59% ] 17/40 VUs  2m56.0s/5m0s  2.00 iters/s

running (2m57.0s), 10/40 VUs, 344 complete and 0 interrupted iterations
money_flow   [  59% ] 10/40 VUs  2m57.0s/5m0s  2.00 iters/s

running (2m58.0s), 09/40 VUs, 347 complete and 0 interrupted iterations
money_flow   [  59% ] 09/40 VUs  2m58.0s/5m0s  2.00 iters/s

running (2m59.0s), 11/40 VUs, 347 complete and 0 interrupted iterations
money_flow   [  60% ] 11/40 VUs  2m59.0s/5m0s  2.00 iters/s

running (3m00.0s), 10/40 VUs, 350 complete and 0 interrupted iterations
money_flow   [  60% ] 10/40 VUs  3m00.0s/5m0s  2.00 iters/s

running (3m01.0s), 06/40 VUs, 356 complete and 0 interrupted iterations
money_flow   [  60% ] 06/40 VUs  3m01.0s/5m0s  2.00 iters/s

running (3m02.0s), 06/40 VUs, 358 complete and 0 interrupted iterations
money_flow   [  61% ] 06/40 VUs  3m02.0s/5m0s  2.00 iters/s

running (3m03.0s), 08/40 VUs, 358 complete and 0 interrupted iterations
money_flow   [  61% ] 08/40 VUs  3m03.0s/5m0s  2.00 iters/s

running (3m04.0s), 10/40 VUs, 358 complete and 0 interrupted iterations
money_flow   [  61% ] 10/40 VUs  3m04.0s/5m0s  2.00 iters/s

running (3m05.0s), 09/40 VUs, 361 complete and 0 interrupted iterations
money_flow   [  62% ] 09/40 VUs  3m05.0s/5m0s  2.00 iters/s

running (3m06.0s), 10/40 VUs, 362 complete and 0 interrupted iterations
money_flow   [  62% ] 10/40 VUs  3m06.0s/5m0s  2.00 iters/s

running (3m07.0s), 09/40 VUs, 365 complete and 0 interrupted iterations
money_flow   [  62% ] 09/40 VUs  3m07.0s/5m0s  2.00 iters/s

running (3m08.0s), 09/40 VUs, 367 complete and 0 interrupted iterations
money_flow   [  63% ] 09/40 VUs  3m08.0s/5m0s  2.00 iters/s

running (3m09.0s), 09/40 VUs, 369 complete and 0 interrupted iterations
money_flow   [  63% ] 09/40 VUs  3m09.0s/5m0s  2.00 iters/s

running (3m10.0s), 10/40 VUs, 370 complete and 0 interrupted iterations
money_flow   [  63% ] 10/40 VUs  3m10.0s/5m0s  2.00 iters/s

running (3m11.0s), 10/40 VUs, 372 complete and 0 interrupted iterations
money_flow   [  64% ] 10/40 VUs  3m11.0s/5m0s  2.00 iters/s

running (3m12.0s), 10/40 VUs, 374 complete and 0 interrupted iterations
money_flow   [  64% ] 10/40 VUs  3m12.0s/5m0s  2.00 iters/s

running (3m13.0s), 11/40 VUs, 375 complete and 0 interrupted iterations
money_flow   [  64% ] 11/40 VUs  3m13.0s/5m0s  2.00 iters/s

running (3m14.0s), 13/40 VUs, 375 complete and 0 interrupted iterations
money_flow   [  65% ] 13/40 VUs  3m14.0s/5m0s  2.00 iters/s

running (3m15.0s), 14/40 VUs, 376 complete and 0 interrupted iterations
money_flow   [  65% ] 14/40 VUs  3m15.0s/5m0s  2.00 iters/s

running (3m16.0s), 15/40 VUs, 377 complete and 0 interrupted iterations
money_flow   [  65% ] 15/40 VUs  3m16.0s/5m0s  2.00 iters/s

running (3m17.0s), 16/40 VUs, 378 complete and 0 interrupted iterations
money_flow   [  66% ] 16/40 VUs  3m17.0s/5m0s  2.00 iters/s

running (3m18.0s), 17/40 VUs, 379 complete and 0 interrupted iterations
money_flow   [  66% ] 17/40 VUs  3m18.0s/5m0s  2.00 iters/s

running (3m19.0s), 18/40 VUs, 380 complete and 0 interrupted iterations
money_flow   [  66% ] 18/40 VUs  3m19.0s/5m0s  2.00 iters/s

running (3m20.0s), 15/40 VUs, 385 complete and 0 interrupted iterations
money_flow   [  67% ] 15/40 VUs  3m20.0s/5m0s  2.00 iters/s

running (3m21.0s), 14/40 VUs, 388 complete and 0 interrupted iterations
money_flow   [  67% ] 14/40 VUs  3m21.0s/5m0s  2.00 iters/s

running (3m22.0s), 15/40 VUs, 389 complete and 0 interrupted iterations
money_flow   [  67% ] 15/40 VUs  3m22.0s/5m0s  2.00 iters/s

running (3m23.0s), 17/40 VUs, 389 complete and 0 interrupted iterations
money_flow   [  68% ] 17/40 VUs  3m23.0s/5m0s  2.00 iters/s

running (3m24.0s), 19/40 VUs, 389 complete and 0 interrupted iterations
money_flow   [  68% ] 19/40 VUs  3m24.0s/5m0s  2.00 iters/s

running (3m25.0s), 17/40 VUs, 393 complete and 0 interrupted iterations
money_flow   [  68% ] 17/40 VUs  3m25.0s/5m0s  2.00 iters/s

running (3m26.0s), 17/40 VUs, 395 complete and 0 interrupted iterations
money_flow   [  69% ] 17/40 VUs  3m26.0s/5m0s  2.00 iters/s

running (3m27.0s), 19/40 VUs, 395 complete and 0 interrupted iterations
money_flow   [  69% ] 19/40 VUs  3m27.0s/5m0s  2.00 iters/s

running (3m28.0s), 18/40 VUs, 398 complete and 0 interrupted iterations
money_flow   [  69% ] 18/40 VUs  3m28.0s/5m0s  2.00 iters/s

running (3m29.0s), 20/40 VUs, 398 complete and 0 interrupted iterations
money_flow   [  70% ] 20/40 VUs  3m29.0s/5m0s  2.00 iters/s

running (3m30.0s), 18/40 VUs, 402 complete and 0 interrupted iterations
money_flow   [  70% ] 18/40 VUs  3m30.0s/5m0s  2.00 iters/s

running (3m31.0s), 11/40 VUs, 411 complete and 0 interrupted iterations
money_flow   [  70% ] 11/40 VUs  3m31.0s/5m0s  2.00 iters/s

running (3m32.0s), 12/40 VUs, 412 complete and 0 interrupted iterations
money_flow   [  71% ] 12/40 VUs  3m32.0s/5m0s  2.00 iters/s

running (3m33.0s), 14/40 VUs, 412 complete and 0 interrupted iterations
money_flow   [  71% ] 14/40 VUs  3m33.0s/5m0s  2.00 iters/s

running (3m34.0s), 16/40 VUs, 412 complete and 0 interrupted iterations
money_flow   [  71% ] 16/40 VUs  3m34.0s/5m0s  2.00 iters/s

running (3m35.0s), 18/40 VUs, 412 complete and 0 interrupted iterations
money_flow   [  72% ] 18/40 VUs  3m35.0s/5m0s  2.00 iters/s

running (3m36.0s), 18/40 VUs, 414 complete and 0 interrupted iterations
money_flow   [  72% ] 18/40 VUs  3m36.0s/5m0s  2.00 iters/s

running (3m37.0s), 20/40 VUs, 414 complete and 0 interrupted iterations
money_flow   [  72% ] 20/40 VUs  3m37.0s/5m0s  2.00 iters/s

running (3m38.0s), 20/40 VUs, 416 complete and 0 interrupted iterations
money_flow   [  73% ] 20/40 VUs  3m38.0s/5m0s  2.00 iters/s

running (3m39.0s), 20/40 VUs, 418 complete and 0 interrupted iterations
money_flow   [  73% ] 20/40 VUs  3m39.0s/5m0s  2.00 iters/s

running (3m40.0s), 20/40 VUs, 420 complete and 0 interrupted iterations
money_flow   [  73% ] 20/40 VUs  3m40.0s/5m0s  2.00 iters/s

running (3m41.0s), 17/40 VUs, 425 complete and 0 interrupted iterations
money_flow   [  74% ] 17/40 VUs  3m41.0s/5m0s  2.00 iters/s

running (3m42.0s), 18/40 VUs, 426 complete and 0 interrupted iterations
money_flow   [  74% ] 18/40 VUs  3m42.0s/5m0s  2.00 iters/s

running (3m43.0s), 17/40 VUs, 429 complete and 0 interrupted iterations
money_flow   [  74% ] 17/40 VUs  3m43.0s/5m0s  2.00 iters/s

running (3m44.0s), 17/40 VUs, 431 complete and 0 interrupted iterations
money_flow   [  75% ] 17/40 VUs  3m44.0s/5m0s  2.00 iters/s

running (3m45.0s), 19/40 VUs, 431 complete and 0 interrupted iterations
money_flow   [  75% ] 19/40 VUs  3m45.0s/5m0s  2.00 iters/s

running (3m46.0s), 18/40 VUs, 434 complete and 0 interrupted iterations
money_flow   [  75% ] 18/40 VUs  3m46.0s/5m0s  2.00 iters/s

running (3m47.0s), 20/40 VUs, 434 complete and 0 interrupted iterations
money_flow   [  76% ] 20/40 VUs  3m47.0s/5m0s  2.00 iters/s

running (3m48.0s), 19/40 VUs, 437 complete and 0 interrupted iterations
money_flow   [  76% ] 19/40 VUs  3m48.0s/5m0s  2.00 iters/s

running (3m49.0s), 18/40 VUs, 440 complete and 0 interrupted iterations
money_flow   [  76% ] 18/40 VUs  3m49.0s/5m0s  2.00 iters/s

running (3m50.0s), 16/40 VUs, 444 complete and 0 interrupted iterations
money_flow   [  77% ] 16/40 VUs  3m50.0s/5m0s  2.00 iters/s

running (3m51.0s), 18/40 VUs, 444 complete and 0 interrupted iterations
money_flow   [  77% ] 18/40 VUs  3m51.0s/5m0s  2.00 iters/s

running (3m52.0s), 20/40 VUs, 444 complete and 0 interrupted iterations
money_flow   [  77% ] 20/40 VUs  3m52.0s/5m0s  2.00 iters/s

running (3m53.0s), 17/40 VUs, 449 complete and 0 interrupted iterations
money_flow   [  78% ] 17/40 VUs  3m53.0s/5m0s  2.00 iters/s

running (3m54.0s), 17/40 VUs, 451 complete and 0 interrupted iterations
money_flow   [  78% ] 17/40 VUs  3m54.0s/5m0s  2.00 iters/s

running (3m55.0s), 18/40 VUs, 452 complete and 0 interrupted iterations
money_flow   [  78% ] 18/40 VUs  3m55.0s/5m0s  2.00 iters/s

running (3m56.0s), 19/40 VUs, 453 complete and 0 interrupted iterations
money_flow   [  79% ] 19/40 VUs  3m56.0s/5m0s  2.00 iters/s

running (3m57.0s), 21/40 VUs, 453 complete and 0 interrupted iterations
money_flow   [  79% ] 21/40 VUs  3m57.0s/5m0s  2.00 iters/s

running (3m58.0s), 21/40 VUs, 455 complete and 0 interrupted iterations
money_flow   [  79% ] 21/40 VUs  3m58.0s/5m0s  2.00 iters/s

running (3m59.0s), 23/40 VUs, 455 complete and 0 interrupted iterations
money_flow   [  80% ] 23/40 VUs  3m59.0s/5m0s  2.00 iters/s

running (4m00.0s), 18/40 VUs, 462 complete and 0 interrupted iterations
money_flow   [  80% ] 18/40 VUs  4m00.0s/5m0s  2.00 iters/s

running (4m01.0s), 19/40 VUs, 463 complete and 0 interrupted iterations
money_flow   [  80% ] 19/40 VUs  4m01.0s/5m0s  2.00 iters/s

running (4m02.0s), 20/40 VUs, 464 complete and 0 interrupted iterations
money_flow   [  81% ] 20/40 VUs  4m02.0s/5m0s  2.00 iters/s

running (4m03.0s), 20/40 VUs, 466 complete and 0 interrupted iterations
money_flow   [  81% ] 20/40 VUs  4m03.0s/5m0s  2.00 iters/s

running (4m04.0s), 14/40 VUs, 474 complete and 0 interrupted iterations
money_flow   [  81% ] 14/40 VUs  4m04.0s/5m0s  2.00 iters/s

running (4m05.0s), 12/40 VUs, 478 complete and 0 interrupted iterations
money_flow   [  82% ] 12/40 VUs  4m05.0s/5m0s  2.00 iters/s

running (4m06.0s), 12/40 VUs, 480 complete and 0 interrupted iterations
money_flow   [  82% ] 12/40 VUs  4m06.0s/5m0s  2.00 iters/s

running (4m07.0s), 12/40 VUs, 482 complete and 0 interrupted iterations
money_flow   [  82% ] 12/40 VUs  4m07.0s/5m0s  2.00 iters/s

running (4m08.0s), 13/40 VUs, 483 complete and 0 interrupted iterations
money_flow   [  83% ] 13/40 VUs  4m08.0s/5m0s  2.00 iters/s

running (4m09.0s), 15/40 VUs, 483 complete and 0 interrupted iterations
money_flow   [  83% ] 15/40 VUs  4m09.0s/5m0s  2.00 iters/s

running (4m10.0s), 16/40 VUs, 484 complete and 0 interrupted iterations
money_flow   [  83% ] 16/40 VUs  4m10.0s/5m0s  2.00 iters/s

running (4m11.0s), 15/40 VUs, 487 complete and 0 interrupted iterations
money_flow   [  84% ] 15/40 VUs  4m11.0s/5m0s  2.00 iters/s

running (4m12.0s), 17/40 VUs, 487 complete and 0 interrupted iterations
money_flow   [  84% ] 17/40 VUs  4m12.0s/5m0s  2.00 iters/s

running (4m13.0s), 17/40 VUs, 489 complete and 0 interrupted iterations
money_flow   [  84% ] 17/40 VUs  4m13.0s/5m0s  2.00 iters/s

running (4m14.0s), 16/40 VUs, 492 complete and 0 interrupted iterations
money_flow   [  85% ] 16/40 VUs  4m14.0s/5m0s  2.00 iters/s

running (4m15.0s), 17/40 VUs, 493 complete and 0 interrupted iterations
money_flow   [  85% ] 17/40 VUs  4m15.0s/5m0s  2.00 iters/s

running (4m16.0s), 12/40 VUs, 500 complete and 0 interrupted iterations
money_flow   [  85% ] 12/40 VUs  4m16.0s/5m0s  2.00 iters/s

running (4m17.0s), 14/40 VUs, 500 complete and 0 interrupted iterations
money_flow   [  86% ] 14/40 VUs  4m17.0s/5m0s  2.00 iters/s

running (4m18.0s), 16/40 VUs, 500 complete and 0 interrupted iterations
money_flow   [  86% ] 16/40 VUs  4m18.0s/5m0s  2.00 iters/s

running (4m19.0s), 15/40 VUs, 503 complete and 0 interrupted iterations
money_flow   [  86% ] 15/40 VUs  4m19.0s/5m0s  2.00 iters/s

running (4m20.0s), 13/40 VUs, 507 complete and 0 interrupted iterations
money_flow   [  87% ] 13/40 VUs  4m20.0s/5m0s  2.00 iters/s

running (4m21.0s), 11/40 VUs, 511 complete and 0 interrupted iterations
money_flow   [  87% ] 11/40 VUs  4m21.0s/5m0s  2.00 iters/s

running (4m22.0s), 10/40 VUs, 514 complete and 0 interrupted iterations
money_flow   [  87% ] 10/40 VUs  4m22.0s/5m0s  2.00 iters/s

running (4m23.0s), 11/40 VUs, 515 complete and 0 interrupted iterations
money_flow   [  88% ] 11/40 VUs  4m23.0s/5m0s  2.00 iters/s

running (4m24.0s), 12/40 VUs, 516 complete and 0 interrupted iterations
money_flow   [  88% ] 12/40 VUs  4m24.0s/5m0s  2.00 iters/s

running (4m25.0s), 11/40 VUs, 519 complete and 0 interrupted iterations
money_flow   [  88% ] 11/40 VUs  4m25.0s/5m0s  2.00 iters/s

running (4m26.0s), 09/40 VUs, 523 complete and 0 interrupted iterations
money_flow   [  89% ] 09/40 VUs  4m26.0s/5m0s  2.00 iters/s

running (4m27.0s), 09/40 VUs, 525 complete and 0 interrupted iterations
money_flow   [  89% ] 09/40 VUs  4m27.0s/5m0s  2.00 iters/s

running (4m28.0s), 11/40 VUs, 525 complete and 0 interrupted iterations
money_flow   [  89% ] 11/40 VUs  4m28.0s/5m0s  2.00 iters/s

running (4m29.0s), 12/40 VUs, 526 complete and 0 interrupted iterations
money_flow   [  90% ] 12/40 VUs  4m29.0s/5m0s  2.00 iters/s

running (4m30.0s), 10/40 VUs, 530 complete and 0 interrupted iterations
money_flow   [  90% ] 10/40 VUs  4m30.0s/5m0s  2.00 iters/s

running (4m31.0s), 11/40 VUs, 531 complete and 0 interrupted iterations
money_flow   [  90% ] 11/40 VUs  4m31.0s/5m0s  2.00 iters/s

running (4m32.0s), 13/40 VUs, 531 complete and 0 interrupted iterations
money_flow   [  91% ] 13/40 VUs  4m32.0s/5m0s  2.00 iters/s

running (4m33.0s), 14/40 VUs, 532 complete and 0 interrupted iterations
money_flow   [  91% ] 14/40 VUs  4m33.0s/5m0s  2.00 iters/s

running (4m34.0s), 14/40 VUs, 534 complete and 0 interrupted iterations
money_flow   [  91% ] 14/40 VUs  4m34.0s/5m0s  2.00 iters/s

running (4m35.0s), 14/40 VUs, 536 complete and 0 interrupted iterations
money_flow   [  92% ] 14/40 VUs  4m35.0s/5m0s  2.00 iters/s

running (4m36.0s), 16/40 VUs, 536 complete and 0 interrupted iterations
money_flow   [  92% ] 16/40 VUs  4m36.0s/5m0s  2.00 iters/s

running (4m37.0s), 16/40 VUs, 538 complete and 0 interrupted iterations
money_flow   [  92% ] 16/40 VUs  4m37.0s/5m0s  2.00 iters/s

running (4m38.0s), 15/40 VUs, 541 complete and 0 interrupted iterations
money_flow   [  93% ] 15/40 VUs  4m38.0s/5m0s  2.00 iters/s

running (4m39.0s), 13/40 VUs, 545 complete and 0 interrupted iterations
money_flow   [  93% ] 13/40 VUs  4m39.0s/5m0s  2.00 iters/s

running (4m40.0s), 13/40 VUs, 547 complete and 0 interrupted iterations
money_flow   [  93% ] 13/40 VUs  4m40.0s/5m0s  2.00 iters/s

running (4m41.0s), 11/40 VUs, 551 complete and 0 interrupted iterations
money_flow   [  94% ] 11/40 VUs  4m41.0s/5m0s  2.00 iters/s

running (4m42.0s), 09/40 VUs, 555 complete and 0 interrupted iterations
money_flow   [  94% ] 09/40 VUs  4m42.0s/5m0s  2.00 iters/s

running (4m43.0s), 10/40 VUs, 556 complete and 0 interrupted iterations
money_flow   [  94% ] 10/40 VUs  4m43.0s/5m0s  2.00 iters/s

running (4m44.0s), 12/40 VUs, 556 complete and 0 interrupted iterations
money_flow   [  95% ] 12/40 VUs  4m44.0s/5m0s  2.00 iters/s

running (4m45.0s), 13/40 VUs, 557 complete and 0 interrupted iterations
money_flow   [  95% ] 13/40 VUs  4m45.0s/5m0s  2.00 iters/s

running (4m46.0s), 13/40 VUs, 559 complete and 0 interrupted iterations
money_flow   [  95% ] 13/40 VUs  4m46.0s/5m0s  2.00 iters/s

running (4m47.0s), 15/40 VUs, 559 complete and 0 interrupted iterations
money_flow   [  96% ] 15/40 VUs  4m47.0s/5m0s  2.00 iters/s

running (4m48.0s), 14/40 VUs, 562 complete and 0 interrupted iterations
money_flow   [  96% ] 14/40 VUs  4m48.0s/5m0s  2.00 iters/s

running (4m49.0s), 12/40 VUs, 566 complete and 0 interrupted iterations
money_flow   [  96% ] 12/40 VUs  4m49.0s/5m0s  2.00 iters/s

running (4m50.0s), 11/40 VUs, 569 complete and 0 interrupted iterations
money_flow   [  97% ] 11/40 VUs  4m50.0s/5m0s  2.00 iters/s

running (4m51.0s), 10/40 VUs, 572 complete and 0 interrupted iterations
money_flow   [  97% ] 10/40 VUs  4m51.0s/5m0s  2.00 iters/s

running (4m52.0s), 11/40 VUs, 573 complete and 0 interrupted iterations
money_flow   [  97% ] 11/40 VUs  4m52.0s/5m0s  2.00 iters/s

running (4m53.0s), 12/40 VUs, 574 complete and 0 interrupted iterations
money_flow   [  98% ] 12/40 VUs  4m53.0s/5m0s  2.00 iters/s

running (4m54.0s), 13/40 VUs, 575 complete and 0 interrupted iterations
money_flow   [  98% ] 13/40 VUs  4m54.0s/5m0s  2.00 iters/s

running (4m55.0s), 14/40 VUs, 576 complete and 0 interrupted iterations
money_flow   [  98% ] 14/40 VUs  4m55.0s/5m0s  2.00 iters/s

running (4m56.0s), 14/40 VUs, 578 complete and 0 interrupted iterations
money_flow   [  99% ] 14/40 VUs  4m56.0s/5m0s  2.00 iters/s

running (4m57.0s), 13/40 VUs, 581 complete and 0 interrupted iterations
money_flow   [  99% ] 13/40 VUs  4m57.0s/5m0s  2.00 iters/s

running (4m58.0s), 13/40 VUs, 583 complete and 0 interrupted iterations
money_flow   [  99% ] 13/40 VUs  4m58.0s/5m0s  2.00 iters/s

running (4m59.0s), 15/40 VUs, 583 complete and 0 interrupted iterations
money_flow   [ 100% ] 15/40 VUs  4m59.0s/5m0s  2.00 iters/s

running (5m00.0s), 14/40 VUs, 586 complete and 0 interrupted iterations
money_flow   [ 100% ] 14/40 VUs  5m00.0s/5m0s  2.00 iters/s

running (5m01.0s), 14/40 VUs, 586 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m02.0s), 12/40 VUs, 588 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m03.0s), 11/40 VUs, 589 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m04.0s), 09/40 VUs, 591 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m05.0s), 09/40 VUs, 591 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m06.0s), 09/40 VUs, 591 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m07.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m08.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m09.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m10.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m11.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m12.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m13.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m14.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m15.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m16.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m17.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m18.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m19.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m20.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m21.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m22.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m23.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m24.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m25.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m26.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m27.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m28.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m29.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s

running (5m30.0s), 08/40 VUs, 592 complete and 0 interrupted iterations
money_flow ↓ [ 100% ] 14/40 VUs  5m0s  2.00 iters/s


  █ THRESHOLDS 

    browse_success
    ✗ 'rate>=0.995' rate=98.31%

    cart_success
    ✓ 'rate>=0.995' rate=99.83%

    checkout_success
    ✓ 'rate>=0.99' rate=99.83%

    dropped_iterations
    ✓ 'count==0' count=0

    http_req_duration{flow:browse}
    ✗ 'p(95)<1000' p(95)=7.05s


  █ TOTAL RESULTS 

    checks_total.......: 2360   7.151507/s
    checks_succeeded...: 99.49% 2348 out of 2360
    checks_failed......: 0.50%  12 out of 2360

    ✗ homepage HTTP 200
      ↳  98% — ✓ 583 / ✗ 10
    ✓ products HTTP 200
    ✗ cart HTTP 200
      ↳  99% — ✓ 591 / ✗ 1
    ✗ checkout HTTP 200 with order
      ↳  99% — ✓ 591 / ✗ 1

    CUSTOM
    browse_success.................: 98.31% 583 out of 593
    cart_success...................: 99.83% 591 out of 592
    checkout_success...............: 99.83% 591 out of 592

    HTTP
    http_req_duration..............: avg=1.73s min=0s       med=512.53ms max=1m0s   p(90)=3.03s  p(95)=4.78s 
      { expected_response:true }...: avg=1.46s min=264.07ms med=511.23ms max=59.65s p(90)=2.91s  p(95)=4.52s 
      { flow:browse }..............: avg=2.21s min=0s       med=495.45ms max=1m0s   p(90)=3.83s  p(95)=7.05s 
    http_req_failed................: 0.59%  14 out of 2372
    http_reqs......................: 2372   7.187871/s

    EXECUTION
    dropped_iterations.............: 0      0/s
    iteration_duration.............: avg=7.31s min=1.49s    med=4.34s    max=3m59s  p(90)=11.51s p(95)=19.18s
    iterations.....................: 592    1.793937/s
    vus............................: 8      min=2          max=29
    vus_max........................: 40     min=40         max=40

    NETWORK
    data_received..................: 13 MB  39 kB/s
    data_sent......................: 536 kB 1.6 kB/s



running (5m30.0s), 00/40 VUs, 592 complete and 8 interrupted iterations
money_flow ✓ [ 100% ] 08/40 VUs  5m0s  2.00 iters/s